002_write_orioledb_compress_all/pgbench_write_2022-05-22T10:04:59.892742449.log
progress: 10.0 s, 41970.8 tps, lat 1.160 ms stddev 1.259
progress: 20.0 s, 42513.8 tps, lat 1.152 ms stddev 2.271
progress: 30.0 s, 42426.2 tps, lat 1.154 ms stddev 2.134
progress: 40.0 s, 41941.9 tps, lat 1.168 ms stddev 2.030
progress: 50.0 s, 42326.4 tps, lat 1.157 ms stddev 2.110
progress: 60.0 s, 42608.3 tps, lat 1.149 ms stddev 1.891
progress: 70.0 s, 42202.5 tps, lat 1.160 ms stddev 2.376
progress: 80.0 s, 42050.1 tps, lat 1.164 ms stddev 0.962
progress: 90.0 s, 42217.0 tps, lat 1.160 ms stddev 0.892
progress: 100.0 s, 41829.6 tps, lat 1.171 ms stddev 2.111
progress: 110.0 s, 42223.3 tps, lat 1.160 ms stddev 1.426
progress: 120.0 s, 42098.7 tps, lat 1.163 ms stddev 1.445
progress: 130.0 s, 41982.6 tps, lat 1.166 ms stddev 1.709
progress: 140.0 s, 41999.3 tps, lat 1.166 ms stddev 1.676
progress: 150.0 s, 42233.1 tps, lat 1.159 ms stddev 0.923
progress: 160.0 s, 41710.2 tps, lat 1.174 ms stddev 1.318
progress: 170.0 s, 42107.9 tps, lat 1.163 ms stddev 0.973
progress: 180.0 s, 42173.6 tps, lat 1.161 ms stddev 1.360
progress: 190.0 s, 41383.2 tps, lat 1.184 ms stddev 1.517
progress: 200.0 s, 42165.5 tps, lat 1.161 ms stddev 1.026
progress: 210.0 s, 42201.9 tps, lat 1.160 ms stddev 0.977
progress: 220.0 s, 41892.4 tps, lat 1.169 ms stddev 1.340
progress: 230.0 s, 41822.6 tps, lat 1.170 ms stddev 0.895
progress: 240.0 s, 42531.1 tps, lat 1.152 ms stddev 0.948
progress: 250.0 s, 42140.7 tps, lat 1.162 ms stddev 0.801
progress: 260.0 s, 42032.6 tps, lat 1.166 ms stddev 1.755
progress: 270.0 s, 42383.5 tps, lat 1.155 ms stddev 0.910
progress: 280.0 s, 42221.1 tps, lat 1.160 ms stddev 1.397
progress: 290.0 s, 42124.8 tps, lat 1.163 ms stddev 1.372
progress: 300.0 s, 41948.7 tps, lat 1.168 ms stddev 1.370
progress: 310.0 s, 42092.3 tps, lat 1.163 ms stddev 0.823
progress: 320.0 s, 41970.1 tps, lat 1.167 ms stddev 1.373
progress: 330.0 s, 41998.7 tps, lat 1.166 ms stddev 1.381
progress: 340.0 s, 42133.3 tps, lat 1.162 ms stddev 0.890
progress: 350.0 s, 42123.6 tps, lat 1.162 ms stddev 0.851
progress: 360.0 s, 42196.9 tps, lat 1.160 ms stddev 0.928
progress: 370.0 s, 42253.6 tps, lat 1.159 ms stddev 0.892
progress: 380.0 s, 41925.1 tps, lat 1.168 ms stddev 0.937
progress: 390.0 s, 42140.2 tps, lat 1.162 ms stddev 0.755
progress: 400.0 s, 41846.6 tps, lat 1.170 ms stddev 0.749
progress: 410.0 s, 41842.3 tps, lat 1.171 ms stddev 0.934
progress: 420.0 s, 42104.2 tps, lat 1.163 ms stddev 0.872
progress: 430.0 s, 42049.6 tps, lat 1.165 ms stddev 0.917
progress: 440.0 s, 42104.3 tps, lat 1.163 ms stddev 0.802
progress: 450.0 s, 42026.8 tps, lat 1.165 ms stddev 0.809
progress: 460.0 s, 41591.1 tps, lat 1.177 ms stddev 0.800
progress: 470.0 s, 41809.3 tps, lat 1.172 ms stddev 0.776
progress: 480.0 s, 40807.5 tps, lat 1.201 ms stddev 0.995
progress: 490.0 s, 39788.1 tps, lat 1.232 ms stddev 0.897
progress: 500.0 s, 39609.3 tps, lat 1.238 ms stddev 1.352
progress: 510.0 s, 39780.2 tps, lat 1.233 ms stddev 0.923
progress: 520.0 s, 39623.7 tps, lat 1.238 ms stddev 0.884
progress: 530.0 s, 39174.4 tps, lat 1.252 ms stddev 0.846
progress: 540.0 s, 39060.4 tps, lat 1.256 ms stddev 0.750
progress: 550.0 s, 39493.7 tps, lat 1.242 ms stddev 0.757
progress: 560.0 s, 39337.5 tps, lat 1.247 ms stddev 0.760
progress: 570.0 s, 39636.2 tps, lat 1.238 ms stddev 0.774
progress: 580.0 s, 39504.3 tps, lat 1.242 ms stddev 0.758
progress: 590.0 s, 39634.7 tps, lat 1.238 ms stddev 0.767
progress: 600.0 s, 39428.8 tps, lat 1.244 ms stddev 0.770
progress: 610.0 s, 39500.0 tps, lat 1.242 ms stddev 0.744
progress: 620.0 s, 39256.6 tps, lat 1.250 ms stddev 0.806
progress: 630.0 s, 39122.2 tps, lat 1.254 ms stddev 0.861
progress: 640.0 s, 39158.3 tps, lat 1.253 ms stddev 0.824
progress: 650.0 s, 39921.8 tps, lat 1.229 ms stddev 0.783
progress: 660.0 s, 39460.5 tps, lat 1.243 ms stddev 0.768
progress: 670.0 s, 38698.1 tps, lat 1.268 ms stddev 0.804
progress: 680.0 s, 38436.8 tps, lat 1.277 ms stddev 0.875
progress: 690.0 s, 38707.8 tps, lat 1.268 ms stddev 0.824
progress: 700.0 s, 39130.1 tps, lat 1.254 ms stddev 0.782
progress: 710.0 s, 39095.1 tps, lat 1.255 ms stddev 0.954
progress: 720.0 s, 39257.6 tps, lat 1.250 ms stddev 0.791
progress: 730.0 s, 38688.8 tps, lat 1.269 ms stddev 0.791
progress: 740.0 s, 38927.0 tps, lat 1.261 ms stddev 0.763
progress: 750.0 s, 38857.7 tps, lat 1.263 ms stddev 0.801
progress: 760.0 s, 38578.4 tps, lat 1.272 ms stddev 0.788
progress: 770.0 s, 38969.8 tps, lat 1.259 ms stddev 0.802
progress: 780.0 s, 39178.2 tps, lat 1.253 ms stddev 0.784
progress: 790.0 s, 38770.2 tps, lat 1.266 ms stddev 0.778
progress: 800.0 s, 38959.8 tps, lat 1.260 ms stddev 0.763
progress: 810.0 s, 38931.4 tps, lat 1.260 ms stddev 0.783
progress: 820.0 s, 38931.5 tps, lat 1.261 ms stddev 0.767
progress: 830.0 s, 38782.3 tps, lat 1.265 ms stddev 0.831
progress: 840.0 s, 38858.6 tps, lat 1.263 ms stddev 0.775
progress: 850.0 s, 38896.3 tps, lat 1.262 ms stddev 0.767
progress: 860.0 s, 38727.1 tps, lat 1.268 ms stddev 0.884
progress: 870.0 s, 39056.6 tps, lat 1.257 ms stddev 0.762
progress: 880.0 s, 38398.7 tps, lat 1.279 ms stddev 0.791
progress: 890.0 s, 38778.2 tps, lat 1.266 ms stddev 0.820
progress: 900.0 s, 38735.0 tps, lat 1.267 ms stddev 0.775
progress: 910.0 s, 38672.2 tps, lat 1.269 ms stddev 0.806
progress: 920.0 s, 38539.1 tps, lat 1.274 ms stddev 0.847
progress: 930.0 s, 38841.2 tps, lat 1.264 ms stddev 0.779
progress: 940.0 s, 38577.5 tps, lat 1.273 ms stddev 0.794
progress: 950.0 s, 39076.6 tps, lat 1.256 ms stddev 0.777
progress: 960.0 s, 38884.8 tps, lat 1.262 ms stddev 0.768
progress: 970.0 s, 38685.1 tps, lat 1.269 ms stddev 0.795
progress: 980.0 s, 38590.2 tps, lat 1.272 ms stddev 0.822
progress: 990.0 s, 38539.3 tps, lat 1.274 ms stddev 0.812
progress: 1000.0 s, 38044.9 tps, lat 1.291 ms stddev 0.811
progress: 1010.0 s, 38225.7 tps, lat 1.285 ms stddev 0.794
progress: 1020.0 s, 38611.5 tps, lat 1.271 ms stddev 0.781
progress: 1030.0 s, 38422.5 tps, lat 1.278 ms stddev 0.795
progress: 1040.0 s, 38686.8 tps, lat 1.269 ms stddev 0.781
progress: 1050.0 s, 38590.7 tps, lat 1.272 ms stddev 0.786
progress: 1060.0 s, 38517.7 tps, lat 1.275 ms stddev 0.767
progress: 1070.0 s, 38382.9 tps, lat 1.279 ms stddev 0.816
progress: 1080.0 s, 38750.8 tps, lat 1.267 ms stddev 0.803
progress: 1090.0 s, 38256.4 tps, lat 1.284 ms stddev 0.821
progress: 1100.0 s, 38549.4 tps, lat 1.274 ms stddev 0.798
progress: 1110.0 s, 38572.5 tps, lat 1.273 ms stddev 0.830
progress: 1120.0 s, 38279.7 tps, lat 1.283 ms stddev 0.800
progress: 1130.0 s, 38508.3 tps, lat 1.275 ms stddev 0.760
progress: 1140.0 s, 38599.8 tps, lat 1.272 ms stddev 0.809
progress: 1150.0 s, 37960.1 tps, lat 1.294 ms stddev 0.791
progress: 1160.0 s, 38230.0 tps, lat 1.284 ms stddev 0.769
progress: 1170.0 s, 38198.7 tps, lat 1.286 ms stddev 0.863
progress: 1180.0 s, 38185.7 tps, lat 1.286 ms stddev 0.782
progress: 1190.0 s, 38474.7 tps, lat 1.276 ms stddev 0.803
progress: 1200.0 s, 37596.5 tps, lat 1.306 ms stddev 0.823
progress: 1210.0 s, 37156.9 tps, lat 1.322 ms stddev 0.807
progress: 1220.0 s, 37678.7 tps, lat 1.304 ms stddev 0.834
progress: 1230.0 s, 36764.5 tps, lat 1.337 ms stddev 0.913
progress: 1240.0 s, 36594.5 tps, lat 1.343 ms stddev 0.875
progress: 1250.0 s, 36500.8 tps, lat 1.346 ms stddev 0.881
progress: 1260.0 s, 36562.8 tps, lat 1.344 ms stddev 0.896
progress: 1270.0 s, 36807.2 tps, lat 1.335 ms stddev 0.826
progress: 1280.0 s, 37309.6 tps, lat 1.317 ms stddev 0.838
progress: 1290.0 s, 36973.9 tps, lat 1.329 ms stddev 0.887
progress: 1300.0 s, 37072.1 tps, lat 1.325 ms stddev 0.874
progress: 1310.0 s, 37190.8 tps, lat 1.321 ms stddev 0.862
progress: 1320.0 s, 37653.2 tps, lat 1.305 ms stddev 0.831
progress: 1330.0 s, 36514.2 tps, lat 1.346 ms stddev 1.110
progress: 1340.0 s, 27242.2 tps, lat 1.811 ms stddev 6.982
progress: 1350.0 s, 37176.7 tps, lat 1.322 ms stddev 0.915
progress: 1360.0 s, 36279.7 tps, lat 1.355 ms stddev 1.173
progress: 1370.0 s, 36051.5 tps, lat 1.363 ms stddev 0.984
progress: 1380.0 s, 35851.9 tps, lat 1.372 ms stddev 1.438
progress: 1390.0 s, 35831.9 tps, lat 1.372 ms stddev 0.978
progress: 1400.0 s, 34195.6 tps, lat 1.439 ms stddev 3.371
progress: 1410.0 s, 34756.7 tps, lat 1.415 ms stddev 1.472
progress: 1420.0 s, 35646.8 tps, lat 1.380 ms stddev 0.959
progress: 1430.0 s, 32645.1 tps, lat 1.508 ms stddev 5.200
progress: 1440.0 s, 30586.0 tps, lat 1.611 ms stddev 7.493
progress: 1450.0 s, 35567.5 tps, lat 1.383 ms stddev 0.894
progress: 1460.0 s, 28396.3 tps, lat 1.738 ms stddev 10.921
progress: 1470.0 s, 26822.8 tps, lat 1.841 ms stddev 11.076
progress: 1480.0 s, 35294.3 tps, lat 1.394 ms stddev 0.976
progress: 1490.0 s, 31901.8 tps, lat 1.544 ms stddev 2.961
progress: 1500.0 s, 35376.3 tps, lat 1.390 ms stddev 0.941
progress: 1510.0 s, 26114.5 tps, lat 1.891 ms stddev 11.401
progress: 1520.0 s, 35381.0 tps, lat 1.390 ms stddev 0.927
progress: 1530.0 s, 29017.3 tps, lat 1.700 ms stddev 5.289
progress: 1540.0 s, 21844.0 tps, lat 2.265 ms stddev 11.002
progress: 1550.0 s, 35542.7 tps, lat 1.384 ms stddev 0.945
progress: 1560.0 s, 31047.8 tps, lat 1.579 ms stddev 3.774
progress: 1570.0 s, 27414.3 tps, lat 1.810 ms stddev 6.685
progress: 1580.0 s, 30583.8 tps, lat 1.612 ms stddev 4.245
progress: 1590.0 s, 34231.8 tps, lat 1.431 ms stddev 1.383
progress: 1600.0 s, 23491.5 tps, lat 2.114 ms stddev 5.855
progress: 1610.0 s, 34083.4 tps, lat 1.444 ms stddev 1.631
progress: 1620.0 s, 34750.3 tps, lat 1.416 ms stddev 0.971
progress: 1630.0 s, 33653.6 tps, lat 1.463 ms stddev 1.043
progress: 1640.0 s, 18745.0 tps, lat 2.643 ms stddev 9.228
progress: 1650.0 s, 33990.7 tps, lat 1.448 ms stddev 1.047
progress: 1660.0 s, 32744.3 tps, lat 1.504 ms stddev 2.607
progress: 1670.0 s, 33158.4 tps, lat 1.481 ms stddev 1.264
progress: 1680.0 s, 21887.7 tps, lat 2.268 ms stddev 6.589
progress: 1690.0 s, 33596.4 tps, lat 1.465 ms stddev 1.037
progress: 1700.0 s, 33852.0 tps, lat 1.454 ms stddev 1.035
progress: 1710.0 s, 20186.1 tps, lat 2.453 ms stddev 6.674
progress: 1720.0 s, 31864.3 tps, lat 1.546 ms stddev 3.637
progress: 1730.0 s, 33437.3 tps, lat 1.472 ms stddev 0.999
progress: 1740.0 s, 31300.4 tps, lat 1.571 ms stddev 2.232
progress: 1750.0 s, 19471.1 tps, lat 2.550 ms stddev 10.035
progress: 1760.0 s, 32126.7 tps, lat 1.533 ms stddev 3.329
progress: 1770.0 s, 33524.1 tps, lat 1.469 ms stddev 0.999
progress: 1780.0 s, 16293.8 tps, lat 3.043 ms stddev 8.294
progress: 1790.0 s, 26857.6 tps, lat 1.839 ms stddev 6.415
progress: 1800.0 s, 33093.0 tps, lat 1.488 ms stddev 1.031
progress: 1810.0 s, 32818.2 tps, lat 1.501 ms stddev 1.057
progress: 1820.0 s, 10871.9 tps, lat 4.575 ms stddev 11.087
progress: 1830.0 s, 32860.5 tps, lat 1.499 ms stddev 1.043
progress: 1840.0 s, 32438.9 tps, lat 1.519 ms stddev 1.058
progress: 1850.0 s, 31962.8 tps, lat 1.541 ms stddev 1.541
progress: 1860.0 s, 10055.9 tps, lat 4.949 ms stddev 13.770
progress: 1870.0 s, 30762.2 tps, lat 1.597 ms stddev 1.781
progress: 1880.0 s, 31856.5 tps, lat 1.552 ms stddev 1.399
progress: 1890.0 s, 25554.3 tps, lat 1.917 ms stddev 7.483
progress: 1900.0 s, 14859.0 tps, lat 3.368 ms stddev 10.075
progress: 1910.0 s, 31941.2 tps, lat 1.542 ms stddev 2.068
progress: 1920.0 s, 4629.9 tps, lat 10.617 ms stddev 152.066
progress: 1930.0 s, 200.4 tps, lat 248.866 ms stddev 155.071
progress: 1940.0 s, 326.6 tps, lat 154.010 ms stddev 147.922
progress: 1950.0 s, 17610.9 tps, lat 2.842 ms stddev 9.327
progress: 1960.0 s, 32639.8 tps, lat 1.508 ms stddev 1.102
progress: 1970.0 s, 32656.1 tps, lat 1.508 ms stddev 1.029
progress: 1980.0 s, 20403.5 tps, lat 2.426 ms stddev 4.723
progress: 1990.0 s, 31317.6 tps, lat 1.573 ms stddev 1.673
progress: 2000.0 s, 32248.8 tps, lat 1.527 ms stddev 1.061
progress: 2010.0 s, 31307.2 tps, lat 1.574 ms stddev 1.537
progress: 2020.0 s, 17556.7 tps, lat 2.824 ms stddev 6.338
progress: 2030.0 s, 32227.1 tps, lat 1.528 ms stddev 1.061
progress: 2040.0 s, 31663.6 tps, lat 1.556 ms stddev 1.094
progress: 2050.0 s, 21209.7 tps, lat 2.332 ms stddev 4.670
progress: 2060.0 s, 26308.8 tps, lat 1.878 ms stddev 3.528
progress: 2070.0 s, 31426.0 tps, lat 1.568 ms stddev 1.097
progress: 2080.0 s, 31285.2 tps, lat 1.575 ms stddev 1.082
progress: 2090.0 s, 13977.8 tps, lat 3.550 ms stddev 9.332
progress: 2100.0 s, 29418.9 tps, lat 1.676 ms stddev 2.941
progress: 2110.0 s, 30877.8 tps, lat 1.596 ms stddev 1.120
progress: 2120.0 s, 29856.2 tps, lat 1.650 ms stddev 1.422
progress: 2130.0 s, 5833.1 tps, lat 8.555 ms stddev 19.897
progress: 2140.0 s, 30883.5 tps, lat 1.596 ms stddev 1.099
progress: 2150.0 s, 28681.5 tps, lat 1.720 ms stddev 5.638
progress: 2160.0 s, 29415.6 tps, lat 1.675 ms stddev 1.719
progress: 2170.0 s, 11396.6 tps, lat 4.366 ms stddev 10.394
progress: 2180.0 s, 29138.6 tps, lat 1.693 ms stddev 3.951
progress: 2190.0 s, 30509.4 tps, lat 1.616 ms stddev 1.128
progress: 2200.0 s, 24165.9 tps, lat 2.044 ms stddev 3.015
progress: 2210.0 s, 11926.7 tps, lat 4.171 ms stddev 10.852
progress: 2220.0 s, 27369.5 tps, lat 1.803 ms stddev 5.352
progress: 2230.0 s, 30056.6 tps, lat 1.641 ms stddev 1.156
progress: 2240.0 s, 10095.0 tps, lat 4.924 ms stddev 9.992
progress: 2250.0 s, 25626.8 tps, lat 1.929 ms stddev 5.867
progress: 2260.0 s, 28314.4 tps, lat 1.743 ms stddev 3.062
progress: 2270.0 s, 20936.8 tps, lat 2.362 ms stddev 6.363
progress: 2280.0 s, 16713.2 tps, lat 2.919 ms stddev 5.215
progress: 2290.0 s, 27372.3 tps, lat 1.835 ms stddev 5.284
progress: 2300.0 s, 29056.1 tps, lat 1.698 ms stddev 1.276
progress: 2310.0 s, 8095.6 tps, lat 6.147 ms stddev 14.183
progress: 2320.0 s, 26079.3 tps, lat 1.893 ms stddev 4.989
progress: 2330.0 s, 29026.2 tps, lat 1.701 ms stddev 1.241
progress: 2340.0 s, 16630.0 tps, lat 2.978 ms stddev 7.880
progress: 2350.0 s, 15943.5 tps, lat 3.112 ms stddev 9.483
progress: 2360.0 s, 24870.7 tps, lat 1.991 ms stddev 5.821
progress: 2370.0 s, 20745.6 tps, lat 2.379 ms stddev 8.100
progress: 2380.0 s, 16470.9 tps, lat 3.007 ms stddev 5.941
progress: 2390.0 s, 21389.3 tps, lat 2.325 ms stddev 7.241
progress: 2400.0 s, 29668.1 tps, lat 1.663 ms stddev 1.155
progress: 2410.0 s, 16366.2 tps, lat 3.030 ms stddev 8.522
progress: 2420.0 s, 16266.0 tps, lat 3.050 ms stddev 8.086
progress: 2430.0 s, 22142.1 tps, lat 2.235 ms stddev 8.054
progress: 2440.0 s, 29434.2 tps, lat 1.677 ms stddev 1.155
progress: 2450.0 s, 15952.9 tps, lat 3.110 ms stddev 9.132
progress: 2460.0 s, 17569.5 tps, lat 2.820 ms stddev 8.057
progress: 2470.0 s, 22948.5 tps, lat 2.157 ms stddev 5.498
progress: 2480.0 s, 22424.3 tps, lat 2.207 ms stddev 6.361
progress: 2490.0 s, 15378.7 tps, lat 3.221 ms stddev 8.867
progress: 2500.0 s, 12279.7 tps, lat 4.055 ms stddev 16.904
progress: 2510.0 s, 29479.3 tps, lat 1.674 ms stddev 1.175
progress: 2520.0 s, 15200.0 tps, lat 3.266 ms stddev 11.275
progress: 2530.0 s, 9602.1 tps, lat 5.180 ms stddev 12.676
progress: 2540.0 s, 29103.3 tps, lat 1.696 ms stddev 1.156
progress: 2550.0 s, 25119.2 tps, lat 1.965 ms stddev 3.618
progress: 2560.0 s, 15628.5 tps, lat 3.179 ms stddev 7.908
progress: 2570.0 s, 19850.8 tps, lat 2.497 ms stddev 6.262
progress: 2580.0 s, 27108.6 tps, lat 1.822 ms stddev 3.098
progress: 2590.0 s, 18885.5 tps, lat 2.624 ms stddev 8.567
progress: 2600.0 s, 10493.9 tps, lat 4.739 ms stddev 10.637
progress: 2610.0 s, 26826.0 tps, lat 1.841 ms stddev 4.460
progress: 2620.0 s, 25352.8 tps, lat 1.950 ms stddev 4.542
progress: 2630.0 s, 18745.3 tps, lat 2.628 ms stddev 7.196
progress: 2640.0 s, 7387.1 tps, lat 6.782 ms stddev 21.218
progress: 2650.0 s, 8685.2 tps, lat 5.698 ms stddev 21.811
progress: 2660.0 s, 21549.7 tps, lat 2.309 ms stddev 6.551
progress: 2670.0 s, 25131.3 tps, lat 1.970 ms stddev 5.162
progress: 2680.0 s, 27344.2 tps, lat 1.806 ms stddev 1.269
progress: 2690.0 s, 28106.4 tps, lat 1.757 ms stddev 1.239
progress: 2700.0 s, 9109.2 tps, lat 5.465 ms stddev 26.950
progress: 2710.0 s, 10626.6 tps, lat 4.673 ms stddev 12.243
progress: 2720.0 s, 16125.4 tps, lat 3.081 ms stddev 9.014
progress: 2730.0 s, 26979.9 tps, lat 1.821 ms stddev 2.259
progress: 2740.0 s, 14157.2 tps, lat 3.528 ms stddev 14.402
progress: 2750.0 s, 15481.0 tps, lat 3.184 ms stddev 8.148
progress: 2760.0 s, 19431.7 tps, lat 2.567 ms stddev 8.029
progress: 2770.0 s, 23360.5 tps, lat 2.118 ms stddev 4.314
progress: 2780.0 s, 12512.3 tps, lat 3.974 ms stddev 13.041
progress: 2790.0 s, 8503.1 tps, lat 5.853 ms stddev 14.387
progress: 2800.0 s, 27472.2 tps, lat 1.798 ms stddev 1.258
progress: 2810.0 s, 10840.2 tps, lat 4.552 ms stddev 11.623
progress: 2820.0 s, 14601.1 tps, lat 3.423 ms stddev 10.308
progress: 2830.0 s, 19706.8 tps, lat 2.517 ms stddev 6.060
progress: 2840.0 s, 23475.9 tps, lat 2.100 ms stddev 4.598
progress: 2850.0 s, 13428.5 tps, lat 3.714 ms stddev 11.251
progress: 2860.0 s, 3171.1 tps, lat 15.734 ms stddev 23.058
progress: 2870.0 s, 27888.4 tps, lat 1.771 ms stddev 1.155
progress: 2880.0 s, 14657.7 tps, lat 3.345 ms stddev 10.420
progress: 2890.0 s, 12987.7 tps, lat 3.877 ms stddev 13.795
progress: 2900.0 s, 11462.5 tps, lat 4.338 ms stddev 12.210
progress: 2910.0 s, 27753.8 tps, lat 1.780 ms stddev 1.205
progress: 2920.0 s, 7075.2 tps, lat 7.036 ms stddev 13.744
progress: 2930.0 s, 14594.2 tps, lat 3.404 ms stddev 9.117
progress: 2940.0 s, 17225.1 tps, lat 2.882 ms stddev 10.043
progress: 2950.0 s, 19644.3 tps, lat 2.516 ms stddev 8.688
progress: 2960.0 s, 14160.1 tps, lat 3.518 ms stddev 11.965
progress: 2970.0 s, 15529.1 tps, lat 3.192 ms stddev 11.615
progress: 2980.0 s, 10980.3 tps, lat 4.537 ms stddev 22.387
progress: 2990.0 s, 6082.9 tps, lat 8.126 ms stddev 95.633
progress: 3000.0 s, 184.9 tps, lat 264.588 ms stddev 172.545
progress: 3010.0 s, 163.6 tps, lat 308.523 ms stddev 163.778
progress: 3020.0 s, 499.5 tps, lat 101.366 ms stddev 83.532
progress: 3030.0 s, 14925.7 tps, lat 3.349 ms stddev 9.037
progress: 3040.0 s, 27288.9 tps, lat 1.780 ms stddev 1.010
progress: 3050.0 s, 27061.6 tps, lat 1.859 ms stddev 33.033
progress: 3060.0 s, 15542.9 tps, lat 3.191 ms stddev 6.027
progress: 3070.0 s, 2406.6 tps, lat 20.744 ms stddev 12.973
progress: 3080.0 s, 23182.9 tps, lat 2.136 ms stddev 3.397
progress: 3090.0 s, 26482.7 tps, lat 1.866 ms stddev 1.174
progress: 3100.0 s, 21114.8 tps, lat 2.344 ms stddev 4.113
progress: 3110.0 s, 2432.8 tps, lat 20.531 ms stddev 9.822
progress: 3120.0 s, 24391.0 tps, lat 2.030 ms stddev 2.156
progress: 3130.0 s, 23223.6 tps, lat 2.131 ms stddev 3.346
progress: 3140.0 s, 20686.0 tps, lat 2.395 ms stddev 3.600
progress: 3150.0 s, 4604.2 tps, lat 10.831 ms stddev 11.124
progress: 3160.0 s, 25695.4 tps, lat 1.924 ms stddev 2.138
progress: 3170.0 s, 18208.8 tps, lat 2.724 ms stddev 4.165
progress: 3180.0 s, 25679.5 tps, lat 1.922 ms stddev 1.417
progress: 3190.0 s, 5009.4 tps, lat 9.973 ms stddev 11.421
progress: 3200.0 s, 24546.2 tps, lat 2.011 ms stddev 3.691
progress: 3210.0 s, 9298.2 tps, lat 5.367 ms stddev 12.222
progress: 3220.0 s, 20254.1 tps, lat 2.444 ms stddev 3.495
progress: 3230.0 s, 11961.5 tps, lat 4.162 ms stddev 9.809
progress: 3240.0 s, 18143.5 tps, lat 2.734 ms stddev 4.026
progress: 3250.0 s, 26203.6 tps, lat 1.886 ms stddev 1.147
progress: 3260.0 s, 15088.1 tps, lat 3.290 ms stddev 4.682
progress: 3270.0 s, 15723.6 tps, lat 3.158 ms stddev 6.061
progress: 3280.0 s, 24812.7 tps, lat 1.993 ms stddev 1.359
progress: 3290.0 s, 25247.7 tps, lat 1.959 ms stddev 1.325
progress: 3300.0 s, 11457.8 tps, lat 4.339 ms stddev 6.563
progress: 3310.0 s, 20963.9 tps, lat 2.363 ms stddev 3.107
progress: 3320.0 s, 23376.9 tps, lat 2.117 ms stddev 2.113
progress: 3330.0 s, 18418.6 tps, lat 2.692 ms stddev 4.534
progress: 3340.0 s, 15250.9 tps, lat 3.256 ms stddev 4.253
progress: 3350.0 s, 23329.6 tps, lat 2.121 ms stddev 2.678
progress: 3360.0 s, 24733.2 tps, lat 2.000 ms stddev 1.460
progress: 3370.0 s, 13909.8 tps, lat 3.572 ms stddev 5.850
progress: 3380.0 s, 20413.0 tps, lat 2.427 ms stddev 3.085
progress: 3390.0 s, 24403.1 tps, lat 2.028 ms stddev 2.457
progress: 3400.0 s, 16139.7 tps, lat 3.075 ms stddev 4.575
progress: 3410.0 s, 12194.7 tps, lat 4.079 ms stddev 8.144
progress: 3420.0 s, 23975.8 tps, lat 2.064 ms stddev 1.602
progress: 3430.0 s, 25356.4 tps, lat 1.951 ms stddev 1.278
progress: 3440.0 s, 9342.1 tps, lat 5.325 ms stddev 6.677
progress: 3450.0 s, 19185.4 tps, lat 2.585 ms stddev 3.078
progress: 3460.0 s, 25199.3 tps, lat 1.963 ms stddev 1.317
progress: 3470.0 s, 23736.6 tps, lat 2.084 ms stddev 1.749
progress: 3480.0 s, 3003.2 tps, lat 16.572 ms stddev 19.290
progress: 3490.0 s, 24979.2 tps, lat 1.987 ms stddev 2.951
progress: 3500.0 s, 24960.5 tps, lat 1.982 ms stddev 1.382
progress: 3510.0 s, 17015.5 tps, lat 2.911 ms stddev 6.156
progress: 3520.0 s, 4618.9 tps, lat 10.809 ms stddev 14.583
progress: 3530.0 s, 24426.3 tps, lat 2.027 ms stddev 1.461
progress: 3540.0 s, 25263.5 tps, lat 1.958 ms stddev 1.263
progress: 3550.0 s, 14438.0 tps, lat 3.435 ms stddev 4.855
progress: 3560.0 s, 11642.4 tps, lat 4.278 ms stddev 7.729
progress: 3570.0 s, 24929.3 tps, lat 1.985 ms stddev 1.289
progress: 3580.0 s, 24607.2 tps, lat 2.011 ms stddev 1.373
progress: 3590.0 s, 6874.5 tps, lat 7.241 ms stddev 9.568
progress: 3600.0 s, 20938.7 tps, lat 2.368 ms stddev 4.518
transaction type: pgbench_write_orioledb.sql
scaling factor: 1
query mode: simple
number of clients: 50
number of threads: 5
duration: 3600 s
number of transactions actually processed: 102891417
latency average = 1.726 ms
latency stddev = 6.618 ms
tps = 28580.923996 (including connections establishing)
tps = 28580.966041 (excluding connections establishing)
statement latencies in milliseconds:
         0.000  \set region_id 0
         0.005  \set ns_id random_zipfian(1, 10, 1.1)
         0.002  \set emitter random_zipfian(1000, 3000, 1.1)
         0.001  \set root_player_id random(1, 100000*:scale)
         0.003  \set currency_id random_zipfian(1, 50, 1.1)
         0.000  \set amount random(1, 10000)
         0.101  BEGIN;
         0.333  INSERT INTO trx_pgbench_0
         0.258  INSERT INTO op_pgbench_0
         0.206  INSERT INTO balance_version_pgbench_0
         0.255  INSERT INTO balance_pgbench_0
         0.562  END;